MikroElektronika/core_packages/PIC/XC8/def/PIC16F19156/mcu.h
// PORTC<RC4>
extern volatile __bit                   RC4                 __at(0x74);	// @ (0xE * 8 + 4)
#define                                 RC4_bit             _BIT_ACCESS(PORTC,4)
// RC4PPS<RC4PPS0>
extern volatile __bit                   RC4PPS0             __at(0xF920);	// @ (0x1F24 * 8 + 0)
#define                                 RC4PPS0_bit         _BIT_ACCESS(RC4PPS,0)
// RC4PPS<RC4PPS1>
extern volatile __bit                   RC4PPS1             __at(0xF921);	// @ (0x1F24 * 8 + 1)
#define                                 RC4PPS1_bit         _BIT_ACCESS(RC4PPS,1)
// RC4PPS<RC4PPS2>
extern volatile __bit                   RC4PPS2             __at(0xF922);	// @ (0x1F24 * 8 + 2)
#define                                 RC4PPS2_bit         _BIT_ACCESS(RC4PPS,2)
// RC4PPS<RC4PPS3>
extern volatile __bit                   RC4PPS3             __at(0xF923);	// @ (0x1F24 * 8 + 3)
#define                                 RC4PPS3_bit         _BIT_ACCESS(RC4PPS,3)
// RC4PPS<RC4PPS4>
extern volatile __bit                   RC4PPS4             __at(0xF924);	// @ (0x1F24 * 8 + 4)
#define                                 RC4PPS4_bit         _BIT_ACCESS(RC4PPS,4)
// PORTC<RC6>
extern volatile __bit                   RC6                 __at(0x76);	// @ (0xE * 8 + 6)
#define                                 RC6_bit             _BIT_ACCESS(PORTC,6)
// RC6PPS<RC6PPS0>
extern volatile __bit                   RC6PPS0             __at(0xF930);	// @ (0x1F26 * 8 + 0)
#define                                 RC6PPS0_bit         _BIT_ACCESS(RC6PPS,0)
// RC6PPS<RC6PPS1>
extern volatile __bit                   RC6PPS1             __at(0xF931);	// @ (0x1F26 * 8 + 1)
#define                                 RC6PPS1_bit         _BIT_ACCESS(RC6PPS,1)
// RC6PPS<RC6PPS2>
extern volatile __bit                   RC6PPS2             __at(0xF932);	// @ (0x1F26 * 8 + 2)
#define                                 RC6PPS2_bit         _BIT_ACCESS(RC6PPS,2)
// RC6PPS<RC6PPS3>
extern volatile __bit                   RC6PPS3             __at(0xF933);	// @ (0x1F26 * 8 + 3)
#define                                 RC6PPS3_bit         _BIT_ACCESS(RC6PPS,3)
// RC6PPS<RC6PPS4>
extern volatile __bit                   RC6PPS4             __at(0xF934);	// @ (0x1F26 * 8 + 4)
#define                                 RC6PPS4_bit         _BIT_ACCESS(RC6PPS,4)
// PORTC<RC7>
extern volatile __bit                   RC7                 __at(0x77);	// @ (0xE * 8 + 7)
#define                                 RC7_bit             _BIT_ACCESS(PORTC,7)
// RC7PPS<RC7PPS0>
extern volatile __bit                   RC7PPS0             __at(0xF938);	// @ (0x1F27 * 8 + 0)
#define                                 RC7PPS0_bit         _BIT_ACCESS(RC7PPS,0)
// RC7PPS<RC7PPS1>
extern volatile __bit                   RC7PPS1             __at(0xF939);	// @ (0x1F27 * 8 + 1)
#define                                 RC7PPS1_bit         _BIT_ACCESS(RC7PPS,1)
// RC7PPS<RC7PPS2>
extern volatile __bit                   RC7PPS2             __at(0xF93A);	// @ (0x1F27 * 8 + 2)
#define                                 RC7PPS2_bit         _BIT_ACCESS(RC7PPS,2)
// RC7PPS<RC7PPS3>
extern volatile __bit                   RC7PPS3             __at(0xF93B);	// @ (0x1F27 * 8 + 3)
#define                                 RC7PPS3_bit         _BIT_ACCESS(RC7PPS,3)
// RC7PPS<RC7PPS4>
extern volatile __bit                   RC7PPS4             __at(0xF93C);	// @ (0x1F27 * 8 + 4)
#define                                 RC7PPS4_bit         _BIT_ACCESS(RC7PPS,4)
// SSP1CON2<RCEN>
extern volatile __bit                   RCEN                __at(0xC8B);	// @ (0x191 * 8 + 3)
#define                                 RCEN_bit            _BIT_ACCESS(SSP1CON2,3)
// SSP1CON2<RCEN1>
extern volatile __bit                   RCEN1               __at(0xC8B);	// @ (0x191 * 8 + 3)
#define                                 RCEN1_bit           _BIT_ACCESS(SSP1CON2,3)
// NVMCON1<RD>
extern volatile __bit                   RD                  __at(0x40F0);	// @ (0x81E * 8 + 0)
#define                                 RD_bit              _BIT_ACCESS(NVMCON1,0)
// T1CON<RD16>
extern volatile __bit                   RD16                __at(0x1071);	// @ (0x20E * 8 + 1)
#define                                 RD16_bit            _BIT_ACCESS(T1CON,1)
// T1CON<RD161>
extern volatile __bit                   RD161               __at(0x1071);	// @ (0x20E * 8 + 1)
#define                                 RD161_bit           _BIT_ACCESS(T1CON,1)
// PORTE<RE3>
extern volatile __bit                   RE3                 __at(0x83);	// @ (0x10 * 8 + 3)
#define                                 RE3_bit             _BIT_ACCESS(PORTE,3)
// SSP1STAT<READ_WRITE>
extern volatile __bit                   READ_WRITE          __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 READ_WRITE_bit      _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<READ_WRITE1>
extern volatile __bit                   READ_WRITE1         __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 READ_WRITE1_bit     _BIT_ACCESS(SSP1STAT,2)
// CWG1AS0<REN>
extern volatile __bit                   REN                 __at(0x3096);	// @ (0x612 * 8 + 6)
#define                                 REN_bit             _BIT_ACCESS(CWG1AS0,6)
// SMT1CON1<REPEAT>
extern volatile __bit                   REPEAT              __at(0x24CE);	// @ (0x499 * 8 + 6)
#define                                 REPEAT_bit          _BIT_ACCESS(SMT1CON1,6)
// ADRESL<RES0>
extern volatile __bit                   RES0                __at(0x4E8);	// @ (0x9D * 8 + 0)
#define                                 RES0_bit            _BIT_ACCESS(ADRESL,0)
// ADRESL<RES1>
extern volatile __bit                   RES1                __at(0x4E9);	// @ (0x9D * 8 + 1)
#define                                 RES1_bit            _BIT_ACCESS(ADRESL,1)
// ADRESH<RES10>
extern volatile __bit                   RES10               __at(0x4F2);	// @ (0x9E * 8 + 2)
#define                                 RES10_bit           _BIT_ACCESS(ADRESH,2)
// ADRESH<RES11>
extern volatile __bit                   RES11               __at(0x4F3);	// @ (0x9E * 8 + 3)
#define                                 RES11_bit           _BIT_ACCESS(ADRESH,3)
// ADRESH<RES12>
extern volatile __bit                   RES12               __at(0x4F4);	// @ (0x9E * 8 + 4)
#define                                 RES12_bit           _BIT_ACCESS(ADRESH,4)
// ADRESH<RES13>
extern volatile __bit                   RES13               __at(0x4F5);	// @ (0x9E * 8 + 5)
#define                                 RES13_bit           _BIT_ACCESS(ADRESH,5)
// ADRESH<RES14>
extern volatile __bit                   RES14               __at(0x4F6);	// @ (0x9E * 8 + 6)
#define                                 RES14_bit           _BIT_ACCESS(ADRESH,6)
// ADRESH<RES15>
extern volatile __bit                   RES15               __at(0x4F7);	// @ (0x9E * 8 + 7)
#define                                 RES15_bit           _BIT_ACCESS(ADRESH,7)
// ADRESL<RES2>
extern volatile __bit                   RES2                __at(0x4EA);	// @ (0x9D * 8 + 2)
#define                                 RES2_bit            _BIT_ACCESS(ADRESL,2)
// ADRESL<RES3>
extern volatile __bit                   RES3                __at(0x4EB);	// @ (0x9D * 8 + 3)
#define                                 RES3_bit            _BIT_ACCESS(ADRESL,3)
// ADRESL<RES4>
extern volatile __bit                   RES4                __at(0x4EC);	// @ (0x9D * 8 + 4)
#define                                 RES4_bit            _BIT_ACCESS(ADRESL,4)
// ADRESL<RES5>
extern volatile __bit                   RES5                __at(0x4ED);	// @ (0x9D * 8 + 5)
#define                                 RES5_bit            _BIT_ACCESS(ADRESL,5)
// ADRESL<RES6>
extern volatile __bit                   RES6                __at(0x4EE);	// @ (0x9D * 8 + 6)
#define                                 RES6_bit            _BIT_ACCESS(ADRESL,6)
// ADRESL<RES7>
extern volatile __bit                   RES7                __at(0x4EF);	// @ (0x9D * 8 + 7)
#define                                 RES7_bit            _BIT_ACCESS(ADRESL,7)
// ADRESH<RES8>
extern volatile __bit                   RES8                __at(0x4F0);	// @ (0x9E * 8 + 0)
#define                                 RES8_bit            _BIT_ACCESS(ADRESH,0)
// ADRESH<RES9>
extern volatile __bit                   RES9                __at(0x4F1);	// @ (0x9E * 8 + 1)
#define                                 RES9_bit            _BIT_ACCESS(ADRESH,1)
// CPUDOZE<ROI>
extern volatile __bit                   ROI                 __at(0x4465);	// @ (0x88C * 8 + 5)
#define                                 ROI_bit             _BIT_ACCESS(CPUDOZE,5)
// ADRPT<RPT0>
extern volatile __bit                   RPT0                __at(0x4D0);	// @ (0x9A * 8 + 0)
#define                                 RPT0_bit            _BIT_ACCESS(ADRPT,0)
// ADRPT<RPT1>
extern volatile __bit                   RPT1                __at(0x4D1);	// @ (0x9A * 8 + 1)
#define                                 RPT1_bit            _BIT_ACCESS(ADRPT,1)
// ADRPT<RPT2>
extern volatile __bit                   RPT2                __at(0x4D2);	// @ (0x9A * 8 + 2)
#define                                 RPT2_bit            _BIT_ACCESS(ADRPT,2)
// ADRPT<RPT3>
extern volatile __bit                   RPT3                __at(0x4D3);	// @ (0x9A * 8 + 3)
#define                                 RPT3_bit            _BIT_ACCESS(ADRPT,3)
// ADRPT<RPT4>
extern volatile __bit                   RPT4                __at(0x4D4);	// @ (0x9A * 8 + 4)
#define                                 RPT4_bit            _BIT_ACCESS(ADRPT,4)
// ADRPT<RPT5>
extern volatile __bit                   RPT5                __at(0x4D5);	// @ (0x9A * 8 + 5)
#define                                 RPT5_bit            _BIT_ACCESS(ADRPT,5)
// ADRPT<RPT6>
extern volatile __bit                   RPT6                __at(0x4D6);	// @ (0x9A * 8 + 6)
#define                                 RPT6_bit            _BIT_ACCESS(ADRPT,6)
// ADRPT<RPT7>
extern volatile __bit                   RPT7                __at(0x4D7);	// @ (0x9A * 8 + 7)
#define                                 RPT7_bit            _BIT_ACCESS(ADRPT,7)
// SSP1CON2<RSEN>
extern volatile __bit                   RSEN                __at(0xC89);	// @ (0x191 * 8 + 1)
#define                                 RSEN_bit            _BIT_ACCESS(SSP1CON2,1)
// SSP1CON2<RSEN1>
extern volatile __bit                   RSEN1               __at(0xC89);	// @ (0x191 * 8 + 1)
#define                                 RSEN1_bit           _BIT_ACCESS(SSP1CON2,1)
// SMT1STAT<RST>
extern volatile __bit                   RST                 __at(0x24D5);	// @ (0x49A * 8 + 5)
#define                                 RST_bit             _BIT_ACCESS(SMT1STAT,5)
// PIE8<RTCCIE>
extern volatile __bit                   RTCCIE              __at(0x38F6);	// @ (0x71E * 8 + 6)
#define                                 RTCCIE_bit          _BIT_ACCESS(PIE8,6)
// PIR8<RTCCIF>
extern volatile __bit                   RTCCIF              __at(0x38A6);	// @ (0x714 * 8 + 6)
#define                                 RTCCIF_bit          _BIT_ACCESS(PIR8,6)
// RTCCON<RTCCLKSEL0>
extern volatile __bit                   RTCCLKSEL0          __at(0x6060);	// @ (0xC0C * 8 + 0)
#define                                 RTCCLKSEL0_bit      _BIT_ACCESS(RTCCON,0)
// RTCCON<RTCCLKSEL1>
extern volatile __bit                   RTCCLKSEL1          __at(0x6061);	// @ (0xC0C * 8 + 1)
#define                                 RTCCLKSEL1_bit      _BIT_ACCESS(RTCCON,1)
// PMD2<RTCCMD>
extern volatile __bit                   RTCCMD              __at(0x3CC7);	// @ (0x798 * 8 + 7)
#define                                 RTCCMD_bit          _BIT_ACCESS(PMD2,7)
// RTCCON<RTCEN>
extern volatile __bit                   RTCEN               __at(0x6067);	// @ (0xC0C * 8 + 7)
#define                                 RTCEN_bit           _BIT_ACCESS(RTCCON,7)
// RTCCON<RTCSYNC>
extern volatile __bit                   RTCSYNC             __at(0x6064);	// @ (0xC0C * 8 + 4)
#define                                 RTCSYNC_bit         _BIT_ACCESS(RTCCON,4)
// RTCCON<RTCWREN>
extern volatile __bit                   RTCWREN             __at(0x6065);	// @ (0xC0C * 8 + 5)
#define                                 RTCWREN_bit         _BIT_ACCESS(RTCCON,5)
// SSP1STAT<RW>
extern volatile __bit                   RW                  __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 RW_bit              _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<RW1>
extern volatile __bit                   RW1                 __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 RW1_bit             _BIT_ACCESS(SSP1STAT,2)
// RX1PPS<RX1PPS0>
extern volatile __bit                   RX1PPS0             __at(0xF658);	// @ (0x1ECB * 8 + 0)
#define                                 RX1PPS0_bit         _BIT_ACCESS(RX1PPS,0)
// RX1PPS<RX1PPS1>
extern volatile __bit                   RX1PPS1             __at(0xF659);	// @ (0x1ECB * 8 + 1)
#define                                 RX1PPS1_bit         _BIT_ACCESS(RX1PPS,1)
// RX1PPS<RX1PPS2>
extern volatile __bit                   RX1PPS2             __at(0xF65A);	// @ (0x1ECB * 8 + 2)
#define                                 RX1PPS2_bit         _BIT_ACCESS(RX1PPS,2)
// RX1PPS<RX1PPS3>
extern volatile __bit                   RX1PPS3             __at(0xF65B);	// @ (0x1ECB * 8 + 3)
#define                                 RX1PPS3_bit         _BIT_ACCESS(RX1PPS,3)
// RX1PPS<RX1PPS4>
extern volatile __bit                   RX1PPS4             __at(0xF65C);	// @ (0x1ECB * 8 + 4)
#define                                 RX1PPS4_bit         _BIT_ACCESS(RX1PPS,4)
// RX2PPS<RX2PPS0>
extern volatile __bit                   RX2PPS0             __at(0xF668);	// @ (0x1ECD * 8 + 0)
#define                                 RX2PPS0_bit         _BIT_ACCESS(RX2PPS,0)
// RX2PPS<RX2PPS1>
extern volatile __bit                   RX2PPS1             __at(0xF669);	// @ (0x1ECD * 8 + 1)
#define                                 RX2PPS1_bit         _BIT_ACCESS(RX2PPS,1)
// RX2PPS<RX3PPS2>
extern volatile __bit                   RX3PPS2             __at(0xF66A);	// @ (0x1ECD * 8 + 2)
#define                                 RX3PPS2_bit         _BIT_ACCESS(RX2PPS,2)
// RX2PPS<RX4PPS3>
extern volatile __bit                   RX4PPS3             __at(0xF66B);	// @ (0x1ECD * 8 + 3)
#define                                 RX4PPS3_bit         _BIT_ACCESS(RX2PPS,3)
// RX2PPS<RX5PPS4>
extern volatile __bit                   RX5PPS4             __at(0xF66C);	// @ (0x1ECD * 8 + 4)
#define                                 RX5PPS4_bit         _BIT_ACCESS(RX2PPS,4)
// SSP1STAT<R_W>
extern volatile __bit                   R_W                 __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 R_W_bit             _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<R_W1>
extern volatile __bit                   R_W1                __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 R_W1_bit            _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<R_nW>
extern volatile __bit                   R_nW                __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 R_nW_bit            _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<R_nW1>
extern volatile __bit                   R_nW1               __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 R_nW1_bit           _BIT_ACCESS(SSP1STAT,2)
// LCDDATA0<S00C0>
extern volatile __bit                   S00C0               __at(0xE8C0);	// @ (0x1D18 * 8 + 0)
#define                                 S00C0_bit           _BIT_ACCESS(LCDDATA0,0)
// LCDDATA6<S00C1>
extern volatile __bit                   S00C1               __at(0xE8F0);	// @ (0x1D1E * 8 + 0)
#define                                 S00C1_bit           _BIT_ACCESS(LCDDATA6,0)
// LCDDATA12<S00C2>
extern volatile __bit                   S00C2               __at(0xE920);	// @ (0x1D24 * 8 + 0)
#define                                 S00C2_bit           _BIT_ACCESS(LCDDATA12,0)
// LCDDATA18<S00C3>
extern volatile __bit                   S00C3               __at(0xE950);	// @ (0x1D2A * 8 + 0)
#define                                 S00C3_bit           _BIT_ACCESS(LCDDATA18,0)
// LCDDATA24<S00C4>
extern volatile __bit                   S00C4               __at(0xE980);	// @ (0x1D30 * 8 + 0)
#define                                 S00C4_bit           _BIT_ACCESS(LCDDATA24,0)
// LCDDATA30<S00C5>
extern volatile __bit                   S00C5               __at(0xE9B0);	// @ (0x1D36 * 8 + 0)
#define                                 S00C5_bit           _BIT_ACCESS(LCDDATA30,0)
// LCDDATA36<S00C6>
extern volatile __bit                   S00C6               __at(0xE9E0);	// @ (0x1D3C * 8 + 0)
#define                                 S00C6_bit           _BIT_ACCESS(LCDDATA36,0)
// LCDDATA42<S00C7>
extern volatile __bit                   S00C7               __at(0xEA10);	// @ (0x1D42 * 8 + 0)
#define                                 S00C7_bit           _BIT_ACCESS(LCDDATA42,0)
// LCDDATA0<S01C0>
extern volatile __bit                   S01C0               __at(0xE8C1);	// @ (0x1D18 * 8 + 1)
#define                                 S01C0_bit           _BIT_ACCESS(LCDDATA0,1)
// LCDDATA6<S01C1>
extern volatile __bit                   S01C1               __at(0xE8F1);	// @ (0x1D1E * 8 + 1)
#define                                 S01C1_bit           _BIT_ACCESS(LCDDATA6,1)
// LCDDATA12<S01C2>
extern volatile __bit                   S01C2               __at(0xE921);	// @ (0x1D24 * 8 + 1)
#define                                 S01C2_bit           _BIT_ACCESS(LCDDATA12,1)
// LCDDATA18<S01C3>
extern volatile __bit                   S01C3               __at(0xE951);	// @ (0x1D2A * 8 + 1)
#define                                 S01C3_bit           _BIT_ACCESS(LCDDATA18,1)
// LCDDATA24<S01C4>
extern volatile __bit                   S01C4               __at(0xE981);	// @ (0x1D30 * 8 + 1)
#define                                 S01C4_bit           _BIT_ACCESS(LCDDATA24,1)
// LCDDATA30<S01C5>
extern volatile __bit                   S01C5               __at(0xE9B1);	// @ (0x1D36 * 8 + 1)
#define                                 S01C5_bit           _BIT_ACCESS(LCDDATA30,1)
// LCDDATA36<S01C6>
extern volatile __bit                   S01C6               __at(0xE9E1);	// @ (0x1D3C * 8 + 1)
#define                                 S01C6_bit           _BIT_ACCESS(LCDDATA36,1)
// LCDDATA42<S01C7>
extern volatile __bit                   S01C7               __at(0xEA11);	// @ (0x1D42 * 8 + 1)
#define                                 S01C7_bit           _BIT_ACCESS(LCDDATA42,1)
// LCDDATA0<S02C0>
extern volatile __bit                   S02C0               __at(0xE8C2);	// @ (0x1D18 * 8 + 2)
#define                                 S02C0_bit           _BIT_ACCESS(LCDDATA0,2)
// LCDDATA6<S02C1>
extern volatile __bit                   S02C1               __at(0xE8F2);	// @ (0x1D1E * 8 + 2)
#define                                 S02C1_bit           _BIT_ACCESS(LCDDATA6,2)
// LCDDATA12<S02C2>
extern volatile __bit                   S02C2               __at(0xE922);	// @ (0x1D24 * 8 + 2)
#define                                 S02C2_bit           _BIT_ACCESS(LCDDATA12,2)
// LCDDATA18<S02C3>
extern volatile __bit                   S02C3               __at(0xE952);	// @ (0x1D2A * 8 + 2)
#define                                 S02C3_bit           _BIT_ACCESS(LCDDATA18,2)
// LCDDATA24<S02C4>
extern volatile __bit                   S02C4               __at(0xE982);	// @ (0x1D30 * 8 + 2)
#define                                 S02C4_bit           _BIT_ACCESS(LCDDATA24,2)
// LCDDATA30<S02C5>
extern volatile __bit                   S02C5               __at(0xE9B2);	// @ (0x1D36 * 8 + 2)
#define                                 S02C5_bit           _BIT_ACCESS(LCDDATA30,2)
// LCDDATA36<S02C6>
extern volatile __bit                   S02C6               __at(0xE9E2);	// @ (0x1D3C * 8 + 2)
#define                                 S02C6_bit           _BIT_ACCESS(LCDDATA36,2)
// LCDDATA42<S02C7>
extern volatile __bit                   S02C7               __at(0xEA12);	// @ (0x1D42 * 8 + 2)
#define                                 S02C7_bit           _BIT_ACCESS(LCDDATA42,2)
// LCDDATA0<S03C0>
extern volatile __bit                   S03C0               __at(0xE8C3);	// @ (0x1D18 * 8 + 3)
#define                                 S03C0_bit           _BIT_ACCESS(LCDDATA0,3)
// LCDDATA6<S03C1>
extern volatile __bit                   S03C1               __at(0xE8F3);	// @ (0x1D1E * 8 + 3)
#define                                 S03C1_bit           _BIT_ACCESS(LCDDATA6,3)
// LCDDATA12<S03C2>
extern volatile __bit                   S03C2               __at(0xE923);	// @ (0x1D24 * 8 + 3)
#define                                 S03C2_bit           _BIT_ACCESS(LCDDATA12,3)
// LCDDATA18<S03C3>
extern volatile __bit                   S03C3               __at(0xE953);	// @ (0x1D2A * 8 + 3)
#define                                 S03C3_bit           _BIT_ACCESS(LCDDATA18,3)
// LCDDATA24<S03C4>
extern volatile __bit                   S03C4               __at(0xE983);	// @ (0x1D30 * 8 + 3)
#define                                 S03C4_bit           _BIT_ACCESS(LCDDATA24,3)
// LCDDATA30<S03C5>
extern volatile __bit                   S03C5               __at(0xE9B3);	// @ (0x1D36 * 8 + 3)
#define                                 S03C5_bit           _BIT_ACCESS(LCDDATA30,3)
// LCDDATA36<S03C6>
extern volatile __bit                   S03C6               __at(0xE9E3);	// @ (0x1D3C * 8 + 3)
#define                                 S03C6_bit           _BIT_ACCESS(LCDDATA36,3)
// LCDDATA42<S03C7>
extern volatile __bit                   S03C7               __at(0xEA13);	// @ (0x1D42 * 8 + 3)
#define                                 S03C7_bit           _BIT_ACCESS(LCDDATA42,3)
// LCDDATA0<S04C0>
extern volatile __bit                   S04C0               __at(0xE8C4);	// @ (0x1D18 * 8 + 4)
#define                                 S04C0_bit           _BIT_ACCESS(LCDDATA0,4)
// LCDDATA6<S04C1>
extern volatile __bit                   S04C1               __at(0xE8F4);	// @ (0x1D1E * 8 + 4)
#define                                 S04C1_bit           _BIT_ACCESS(LCDDATA6,4)
// LCDDATA12<S04C2>
extern volatile __bit                   S04C2               __at(0xE924);	// @ (0x1D24 * 8 + 4)
#define                                 S04C2_bit           _BIT_ACCESS(LCDDATA12,4)
// LCDDATA18<S04C3>
extern volatile __bit                   S04C3               __at(0xE954);	// @ (0x1D2A * 8 + 4)
#define                                 S04C3_bit           _BIT_ACCESS(LCDDATA18,4)
// LCDDATA24<S04C4>
extern volatile __bit                   S04C4               __at(0xE984);	// @ (0x1D30 * 8 + 4)
#define                                 S04C4_bit           _BIT_ACCESS(LCDDATA24,4)
// LCDDATA30<S04C5>
extern volatile __bit                   S04C5               __at(0xE9B4);	// @ (0x1D36 * 8 + 4)
#define                                 S04C5_bit           _BIT_ACCESS(LCDDATA30,4)
// LCDDATA36<S04C6>
extern volatile __bit                   S04C6               __at(0xE9E4);	// @ (0x1D3C * 8 + 4)
#define                                 S04C6_bit           _BIT_ACCESS(LCDDATA36,4)
// LCDDATA42<S04C7>
extern volatile __bit                   S04C7               __at(0xEA14);	// @ (0x1D42 * 8 + 4)
#define                                 S04C7_bit           _BIT_ACCESS(LCDDATA42,4)
// LCDDATA0<S06C0>
extern volatile __bit                   S06C0               __at(0xE8C6);	// @ (0x1D18 * 8 + 6)
#define                                 S06C0_bit           _BIT_ACCESS(LCDDATA0,6)
// LCDDATA6<S06C1>
extern volatile __bit                   S06C1               __at(0xE8F6);	// @ (0x1D1E * 8 + 6)
#define                                 S06C1_bit           _BIT_ACCESS(LCDDATA6,6)
// LCDDATA12<S06C2>
